app/views/events/show.html.erb

SELECT "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."event_id" = $1  [["event_id", 4]]
---
      <div class="ticket-list">
        <% @event.ticket_types.each do |ticket_type| %>