app/controllers/events_controller.rb

  def index
    @events = Event.where('starts_at >= ? and published = true', Date.today).order(starts_at: 'desc')
    if params[:search]
      @events = @events.where('name like ?', "%#{params[:search]}%")
---
SELECT "events".* FROM "events" WHERE (starts_at >= '2017-07-02' and published = true) AND (name like '%c%') ORDER BY "events"."starts_at" DESC
SELECT "events".* FROM "events" WHERE (name ILIKE'%1%')

  def show
    @related_events = Event
                          .joins(:category)
                          .joins(:venue)
                          .joins('inner join regions on regions.id = venues.region_id')
                          .where('events.id <> ? and regions.id = ? and categories.id = ?', @event.id, @event.venue.region_id, @event.category.id)
---
SELECT "events".* FROM "events" INNER JOIN "categories" ON "categories"."id" = "events"."category_id" INNER JOIN "venues" ON "venues"."id" = "events"."venue_id" inner join regions on regions.id = venues.region_id WHERE (events.id <> 4 and regions.id = 5 and categories.id = 3)

  def publish
    if can_edit?(@event)
      if params[:event][:publish] == 'true'
        if @event.can_publish?
          @event.published = true
          @event.save
---
UPDATE "events" SET "published" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["published", "t"], ["updated_at", "2017-07-02 11:49:52.856945"], ["id", 4]]

  def load_data_for_event_form
    @categories = Category.all
    @venues = Venue.all
    @admins = User.where('id <> ?', current_user.id)
---
SELECT "categories".* FROM "categories"
SELECT "venues".* FROM "venues"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]