app/controllers/events_controller.rb

  def index
  	if params[:search]
  		@events = Event.search(params[:search])
---
SELECT "events".* FROM "events"

  def create
  	event_params.merge(user_id: current_user.id)
  	@event = Event.new(event_params)
  	if @event.save
---
INSERT INTO "events" ("starts_at", "ends_at", "venue_id", "hero_image_url", "extended_html_description", "category_id", "name", "created_at", "updated_at", "creator_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    @event = Event.find_by_id(params[:id])
    event_params.merge(user_id: current_user.id)
    if @event.update! event_params
---
UPDATE "events" SET "starts_at" = $1, "ends_at" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["starts_at", "2017-01-07 00:00:00"], ["ends_at", "2017-11-07 00:00:00"], ["updated_at", "2017-07-02 12:32:01.183082"], ["id", 4]]