app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "huycuong0610@gmail.com"], ["LIMIT", 1]]
---
  def create
  	if @user = User.find_by_email(params[:email])