app/controllers/users_controller.rb

	def create
		@user = User.new user_params
		if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

	def update
		if @user.update_attributes(user_update_params)
---
UPDATE "users" SET "avatar" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["avatar", "#<ActionDispatch::Http::UploadedFile:0x007fa359a84f90>"], ["updated_at", "2017-07-01 16:43:25.167301"], ["id", 1]]