app/controllers/users_controller.rb

  def do_login
    @user = User.find_by_email(params[:email]).try(:authenticate, params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "huycuong0610@gmail.com"], ["LIMIT", 1]]

  def do_create_user
    @user = User.new(user_params)
    if @user.valid?
      @user.save
---
INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"